app/views/likes/_like.html.erb

      <% end %>
      いいね<%= profile.likes.count %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."profile_id" = ?  [["profile_id", 1]]