app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "profile_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["profile_id", 1], ["created_at", "2023-05-11 18:01:03.282132"], ["updated_at", "2023-05-11 18:01:03.282132"]]
---
    def create
      Like.create(user_id: current_user.id, profile_id: params[:id])

DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."profile_id" = ? LIMIT ?  [["user_id", 1], ["profile_id", 1], ["LIMIT", 1]]
---
    def destroy
      Like.find_by(user_id: current_user.id, profile_id: params[:id]).destroy