app/controllers/profiles_controller.rb

INSERT INTO "profiles" ("call", "reason", "every", "future", "job", "favorite_point", "free", "created_at", "updated_at", "oshi_name", "user_id", "is_published_flag", "color", "sns", "user_name") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @profile = Profile.new(params.require(:profile).permit(:name, :image, :call, :oshi_name, :reason, :every, :future, :job, :favorite_point, :free, :user_id, :user_name, :is_published_flag, :color, :sns))
    if @profile.save

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @profile = Profile.find(params[:id])

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @profile = Profile.find(params[:id])

SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "profiles" SET "call" = ?, "updated_at" = ?, "user_name" = ? WHERE "profiles"."id" = ?  [["call", "てっちゃん"], ["updated_at", "2023-04-11 11:57:29.173590"], ["user_name", "テスト"], ["id", 1]]
---
  def update
    @profile = Profile.find(params[:id])
    if @profile.update(params.require(:profile).permit(:name, :image, :call, :oshi_name, :reason, :every, :future, :job, :favorite_point, :free, :user_id, :user_name, :is_published_flag, :color, :sns))

SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = ? ORDER BY created_at DESC  [["user_id", 1]]
---
  def myprofile_index
    @profiles = Profile.where(user_id: current_user.id).includes(:user).order("created_at DESC")